sdaiRestoreErrorHandler
\details
The Restore Error Handler function shall remove the most recently added error handling function from
the top of the last in, first out error handler stack.
\remarks  The next most recently added error handling function is left at the top of the error
handler stack. This function has no effect if the error handler stack is empty.